2016/brp 2016-02-09/art/art-proeftuin/KUC001-Afstamming-RegistratieGeboorte/ART/ActualResults/soap/request/Geboorte kind-1-soaprequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <brp:bhg_afsRegistreerGeboorte xmlns:brp="http://www.bzk.nl/brp/brp0200">
         <brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
            <brp:zendendePartij>036101</brp:zendendePartij>
            <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
            <brp:referentienummer>00000000-0000-0000-0001-100000000020</brp:referentienummer>
            <brp:tijdstipVerzending>2014-12-12T14:01:37.830</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="comid.parameters_B00">
            <brp:verwerkingswijze>Bijhouding</brp:verwerkingswijze>
         </brp:parameters>
         <brp:geboorteInNederland brp:objecttype="AdministratieveHandeling"
                                  brp:communicatieID="comid.geboorteInNederland_B00">
            <brp:partijCode>034401</brp:partijCode>
            <brp:toelichtingOntlening>toelichting</brp:toelichtingOntlening>
            <brp:gedeblokkeerdeMeldingen>
               <brp:gedeblokkeerdeMelding brp:objecttype="GedeblokkeerdeMelding"
                                          brp:communicatieID="comid.gedeblokkeerdeMelding_B00"
                                          brp:referentieID="comid.geslachtsnaamcomponent_B00">
                  <brp:regelCode>BRBY0106</brp:regelCode>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:bronnen>
               <brp:bron brp:objecttype="ActieBron" brp:communicatieID="comid.bron_B00">
                  <brp:document brp:objecttype="Document" brp:communicatieID="Document1">
                     <brp:soortNaam>Geboorteakte</brp:soortNaam>
                     <brp:identificatie>identificatieTC0101</brp:identificatie>
                     <brp:aktenummer>1234567</brp:aktenummer>
                     <brp:partijCode>034401</brp:partijCode>
                  </brp:document>
               </brp:bron>
               <brp:bron brp:objecttype="ActieBron" brp:communicatieID="comid.bron_B01">
                  <brp:document brp:objecttype="Document" brp:communicatieID="Document2">
                     <brp:soortNaam>Eerste Inschrijving</brp:soortNaam>
                     <brp:identificatie>123</brp:identificatie>
                     <brp:aktenummer>1234567</brp:aktenummer>
                     <brp:partijCode>034401</brp:partijCode>
                  </brp:document>
               </brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieGeboorte brp:objecttype="Actie" brp:communicatieID="comid.registratieGeboorte_B00">
                  <brp:datumAanvangGeldigheid>2014-12-12</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
                     <brp:bron brp:objecttype="ActieBron" brp:communicatieID="BronDocument0"
                               brp:referentieID="comid.bron_B00"/>
                  </brp:bronnen>
                  <brp:familierechtelijkeBetrekking brp:objecttype="Relatie"
                                                    brp:communicatieID="comid.familierechtelijkeBetrekking_B00">
                     <brp:betrokkenheden>
                        <brp:kind brp:objecttype="Betrokkenheid" brp:communicatieID="comid.kind_B00">
                           <brp:persoon brp:objecttype="Persoon" brp:communicatieID="comid.kindpersoon_B00">
                              <brp:samengesteldeNaam brp:communicatieID="comid.samengesteldeNaam_B00">
                                 <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                              </brp:samengesteldeNaam>
                              <brp:geboorte brp:communicatieID="comid.geboorte_B00">
                                 <brp:datum>2014-12-12</brp:datum>
                                 <brp:gemeenteCode>1773</brp:gemeenteCode>
                              </brp:geboorte>
                              <brp:geslachtsaanduiding brp:communicatieID="comid.geslachtsaanduiding_B00">
                                 <brp:code>V</brp:code>
                              </brp:geslachtsaanduiding>
                              <brp:voornamen>
                                 <brp:voornaam brp:objecttype="PersoonVoornaam" brp:communicatieID="comid.voornaam_B00">
                                    <brp:volgnummer>1</brp:volgnummer>
                                    <brp:naam>Eveline</brp:naam>
                                 </brp:voornaam>
                              </brp:voornamen>
                              <brp:geslachtsnaamcomponenten>
                                 <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent"
                                                             brp:communicatieID="comid.geslachtsnaamcomponent_B00">
                                    <brp:stam>Appelo</brp:stam>
                                 </brp:geslachtsnaamcomponent>
                              </brp:geslachtsnaamcomponenten>
                           </brp:persoon>
                        </brp:kind>
                        <brp:ouder brp:objecttype="Betrokkenheid" brp:communicatieID="comid.ouder1_B00">
                           <brp:persoon brp:objectSleutel="NBZy4+h1Ky4ulGF+uxtVafF0B7eGXZuZ" brp:objecttype="Persoon"
                                        brp:communicatieID="comid.persoon_B01"/>
                           <brp:ouderschap brp:communicatieID="comid.ouderschap_B00">
                              <brp:indicatieAdresgevendeOuder>J</brp:indicatieAdresgevendeOuder>
                           </brp:ouderschap>
                        </brp:ouder>
                        <brp:ouder brp:objecttype="Betrokkenheid" brp:communicatieID="comid.ouder2_B04">
                           <brp:persoon brp:objectSleutel="NBZy4+h1Ky5vu/GDDBMp+fF0B7eGXZuZ" brp:objecttype="Persoon"
                                        brp:communicatieID="comid.persoon_B03"/>
                        </brp:ouder>
                     </brp:betrokkenheden>
                  </brp:familierechtelijkeBetrekking>
               </brp:registratieGeboorte>
               <brp:registratieIdentificatienummers brp:objecttype="Actie" brp:communicatieID="registratieIdentificatienrs_B00">
                  <brp:datumAanvangGeldigheid>2014-12-12</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
                     <brp:bron brp:objecttype="ActieBron" brp:communicatieID="BronDocument12"
                               brp:referentieID="comid.bron_B00"/>
                  </brp:bronnen>
                  <brp:persoon brp:objecttype="Persoon" brp:communicatieID="comid.kindpersoon2"
                               brp:referentieID="comid.kindpersoon_B00">
                     <brp:identificatienummers brp:communicatieID="comid.identificatienummers_B00">
                        <brp:burgerservicenummer>200010992</brp:burgerservicenummer>
                        <brp:administratienummer>1321406948</brp:administratienummer>
                     </brp:identificatienummers>
                  </brp:persoon>
               </brp:registratieIdentificatienummers>
               <brp:registratieNaamgebruik brp:objecttype="Actie" brp:communicatieID="comid.registratieNaamgebruik_B01">
                  <brp:datumAanvangGeldigheid>2014-12-12</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
                     <brp:bron brp:objecttype="ActieBron" brp:communicatieID="BronDocument2"
                               brp:referentieID="comid.bron_B00"/>
                  </brp:bronnen>
                  <brp:persoon brp:objecttype="Persoon" brp:communicatieID="comid.persoon_B05"
                               brp:referentieID="comid.kindpersoon_B00">
                     <brp:naamgebruik brp:communicatieID="comid.naamgebruik_B03">
                        <brp:indicatieAfgeleid>J</brp:indicatieAfgeleid>
                     </brp:naamgebruik>
                  </brp:persoon>
               </brp:registratieNaamgebruik>
               <brp:registratieNationaliteit brp:objecttype="Actie" brp:communicatieID="comid.registratieNationaliteit_B02">
                  <brp:datumAanvangGeldigheid>2014-12-12</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
                     <brp:bron brp:objecttype="ActieBron" brp:communicatieID="BronDocument4"
                               brp:referentieID="comid.bron_B00"/>
                  </brp:bronnen>
                  <brp:persoon brp:objecttype="Persoon" brp:communicatieID="comid.persoon_B06"
                               brp:referentieID="comid.kindpersoon_B00">
                     <brp:nationaliteiten>
                        <brp:nationaliteit brp:objecttype="PersoonNationaliteit"
                                           brp:communicatieID="comid.nationaliteit_B02">
                           <brp:nationaliteitCode>0001</brp:nationaliteitCode>
                           <brp:redenVerkrijgingCode>018</brp:redenVerkrijgingCode>
                        </brp:nationaliteit>
                     </brp:nationaliteiten>
                  </brp:persoon>
               </brp:registratieNationaliteit>
            </brp:acties>
         </brp:geboorteInNederland>
      </brp:bhg_afsRegistreerGeboorte>
   </soapenv:Body>
</soapenv:Envelope>